t = 0
a = 0
for i in range(0, 10):
    x = int(input())
    if x > 9 and x > 0 and x<100:
        t += 1
    elif x == 0:
        break
    else:
        a += 1
print('Двухзначных ', t)
print('Другие ', a)
# с клавиатуры вводятся числа, ввод завершается числом 0.
# Определить, сколько было введено двузначных натуральных чисел,
# и сколько других.

