#с клавиатуры вводятся числа, ввод завершается числом 0.
# Определить, сколько было введено положительных
# и сколько отрицательных чисел.
p = 0
n = 0
for i in range(0, 1000000):
    x = int(input())
    if x< 0:
        n += 1
    elif x > 0:
        p+=1
    elif x == 0:
        break
print ('Положительных ', p)
print ('Отрицательных ', n)