# с клавиатуры вводится число N, а затем – N натуральных чисел.
# Определить минимальное и максимальное среди простых чисел
# (которые делятся на сами не себя и на 1).
# Если таких чисел не было, вывести "нет".
t = 0
a = 0
n = 1
c = 0
m = 0
N = int(input())
for i in range(N):
    x = int(input())
    while(m<1):
        c = x
        b = x
        m+=1
    while (n<x+1):
        if ((x%n)==0):
            t+=1
        n+=1
    n = 1
    if t == 2:
        a+=1
        if b<x:
            b=x
        elif c>x:
            c=x
    t = 0
if a>0:
    print(b,c)
else:
    print('no')




